#include "luaengine.h"
#include <debug.h>
#include <regs.h>
#include <paging.h>
#include <imgui/backends/imgui_impl_opengl3_loader.h>
#include <sdl2/include/SDL.h>
#include "imgui/imgui.h"
#include "imgui/backends/imgui_impl_sdl2.h"
#include "imgui/backends/imgui_impl_opengl3.h"




void WriteBytes(int seg, int ofs1, std::vector<uint8_t>& data) {

    std::vector<char> buffer;
    for(uint16_t x = 0; x < data.size(); x++) {
        uint8_t value;

        if(!mem_writeb_checked((PhysPt)GetAddress(seg, ofs1 + x), data[x]))
        {

        }
    }
}

std::vector<char> GetBytes(int seg, int ofs1) {

    std::vector<char> buffer;
    for(uint16_t x = 0; x < 1024; x++) {
        uint8_t value;

        if(!mem_readb_checked((PhysPt)GetAddress(seg, ofs1 + x), &value))
        {
            buffer.push_back(value);

        }
    }
    return buffer;
}
#pragma pack(push, 1)  // Set the alignment to 1 byte
struct GameData {
    uint8_t CUR_PLAYER_CHR;           // 0x6741
    uint8_t CUR_MON1_CHR;             // 0x6742
    uint8_t CUR_MON2_CHR;             // 0x6743
    uint8_t CUR_MON3_CHR;             // 0x6744
    uint8_t CUR_BACK_CHR;             // 0x6745
    uint8_t CUR_TRAP_CHR;             // 0x6746
    uint8_t CUR_MAP;                  // 0x6747
    uint8_t CUR_MONS_ALG;             // 0x6748
    uint8_t CUR_PAL_BACK;             // 0x6749
    uint16_t CUR_PAL_MONS;            // 0x674A
    uint16_t VIEW_FLAG;               // 0x674C
    uint16_t CUR_VIEW_POINT;          // 0x674E
    uint16_t CUR_OVL_CHR_NO;          // 0x6750
    uint8_t TURN_FLAG;                // 0x6752
    uint8_t FL_FLAG;                  // 0x6753
    uint16_t BANK_CHG_FLAG;           // 0x6754
    uint8_t MZX_OVL_TBL[32];          // 0x6756 (32 bytes)
    uint16_t MZX_ATT_TBL;             // 0x6766
    uint8_t reserved_6768;            // 0x6768
    uint8_t reserved_6769;            // 0x6769
    uint8_t reserved_676A;            // 0x676A
    uint8_t reserved_676B;            // 0x676B
    uint8_t reserved_676C;            // 0x676C
    uint8_t reserved_676D;            // 0x676D
    uint16_t MZX_QUAIK_TBL;           // 0x676E
    uint8_t reserved_6770;            // 0x6770
    uint8_t reserved_6771;            // 0x6771
    uint8_t reserved_6772;            // 0x6772
    uint8_t reserved_6773;            // 0x6773
    uint8_t reserved_6774;            // 0x6774
    uint8_t reserved_6775;            // 0x6775
    uint16_t UNPACK_BX;               // 0x6776
    uint8_t UNPACK_DX;               // 0x6778
    uint8_t reserved_6779;            // 0x6779
    uint16_t CHECK_VIEW_VEC;          // 0x677A
    uint8_t reserved_677C[5];         // 0x677C (5 bytes)
    uint8_t MZX_VEC_TBL[56];          // 0x6782 (56 bytes)
    uint16_t WINDOW_WORK;             // 0x67C2
};
#pragma pack(pop)


// Function to convert GameData to a vector of uint8_t in a single call
std::vector<uint8_t> GameDataToVector(const GameData& data) {
    std::vector<uint8_t> byte_vector(sizeof(data));

    // Copy the entire struct to the vector in a single call
    std::memcpy(byte_vector.data(), &data, sizeof(data));

    return byte_vector;
}

// Function to create the window and run ImGui
void LuaEngine::windowCreationThread(const std::string& title, int width, int height) {
    // Setup SDL
    if(SDL_Init(SDL_INIT_VIDEO | SDL_INIT_TIMER | SDL_INIT_GAMECONTROLLER) != 0)
    {
        printf("Error: %s\n", SDL_GetError());
        return;
    }

    // Decide GL+GLSL versions
#if defined(IMGUI_IMPL_OPENGL_ES2)
    // GL ES 2.0 + GLSL 100 (WebGL 1.0)
    const char* glsl_version = "#version 100";
    SDL_GL_SetAttribute(SDL_GL_CONTEXT_FLAGS, 0);
    SDL_GL_SetAttribute(SDL_GL_CONTEXT_PROFILE_MASK, SDL_GL_CONTEXT_PROFILE_ES);
